Revit 2026 API

# RevitLinkOptionsGetWorksetConfiguration Method

---

Gets the set of worksets to open when creating the link.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public WorksetConfiguration GetWorksetConfiguration()
```
```vb
Public Function GetWorksetConfiguration As WorksetConfiguration
```
```cpp
public:
WorksetConfiguration^ GetWorksetConfiguration()
```
```fsharp
member GetWorksetConfiguration : unit -> WorksetConfiguration
```

#### Return Value

WorksetConfiguration

#### Reference

RevitLinkOptions Class

Autodesk.Revit.DB Namespace